### Handling Categorical Feature

#### One HOT Encoding

In [37]:
import numpy as np

import pandas as pd

In [38]:
df=pd.read_csv('titanic/train.csv',usecols=['Sex'])

In [39]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [40]:
pd.get_dummies(df).head()

   Sex_female  Sex_male
0       False      True
1        True     False
2        True     False
3        True     False
4       False      True

In [33]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0      True
1     False
2     False
3     False
4      True

In [41]:
df=pd.read_csv('titanic/train.csv',usecols=['Embarked'])

In [43]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [44]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [45]:
df.dropna(inplace=True)

In [46]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [47]:
pd.get_dummies(df).head()

   Embarked_C  Embarked_Q  Embarked_S
0       False       False        True
1        True       False       False
2       False       False        True
3       False       False        True
4       False       False        True

In [50]:
pd.get_dummies(df,drop_first=True,.head()

SyntaxError: invalid syntax (3537695040.py, line 1)